attacker/data/ac+filtering+sio/spoofing/ab_results/ab_27.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...bind: Cannot assign requested address (99)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   7.523 seconds
Complete requests:      20
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    1
Total transferred:      238 bytes
HTML transferred:       89 bytes
Requests per second:    2.66 [#/sec] (mean)
Time per request:       3761.597 [ms] (mean)
Time per request:       376.160 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   3.1      4      16
Processing:     2  379 1673.5      6    7489
Waiting:        0  374 1674.1      0    7487
Total:          6  384 1676.3      9    7505

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     10
  80%     10
  90%     11
  95%   7505
  98%   7505
  99%   7505
 100%   7505 (longest request)
