attacker/data/ac+filtering+sio/spoofing/ab_results/ab_61.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...bind: Cannot assign requested address (99)
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   2.551 seconds
Complete requests:      20
Failed requests:        0
Non-2xx responses:      20
Keep-Alive requests:    20
Total transferred:      3960 bytes
HTML transferred:       420 bytes
Requests per second:    7.84 [#/sec] (mean)
Time per request:       1275.279 [ms] (mean)
Time per request:       127.528 [ms] (mean, across all concurrent requests)
Transfer rate:          1.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   3.8      4      15
Processing:   403  743 216.7    916    1039
Waiting:      403  743 216.8    916    1038
Total:        403  746 220.0    919    1053

Percentage of the requests served within a certain time (ms)
  50%    919
  66%    926
  75%    959
  80%    967
  90%    986
  95%   1053
  98%   1053
  99%   1053
 100%   1053 (longest request)
